Revit 2026 API

# PlaneCreateByNormalAndOrigin Method

---

Constructs a Plane object from a normal and an origin represented as XYZ objects. Follows the standard conventions for a planar surface. The constructed Plane object will pass through origin and be perpendicular to normal. The X and Y axes of the plane will be defined arbitrarily.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Plane CreateByNormalAndOrigin(
	XYZ normal,
	XYZ origin
)
```
```vb
Public Shared Function CreateByNormalAndOrigin (
	normal As XYZ,
	origin As XYZ
) As Plane
```
```cpp
public:
static Plane^ CreateByNormalAndOrigin(
	XYZ^ normal,
	XYZ^ origin
)
```
```fsharp
static member CreateByNormalAndOrigin :
        normal : XYZ *
        origin : XYZ -> Plane
```

#### Parameters

normal XYZ
     Plane normal. Expected to be a valid non-zero length vector. Doesn't need to be a unit vector.
origin XYZ
     Plane origin. Expected to lie within the Revit design limits IsWithinLengthLimits(XYZ).

#### Return Value

Plane

| Exception | Condition |
| --- | --- |
| ArgumentException | The input point lies outside of Revit design limits. |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | normal has zero length. |

This function does not guarantee a specific parameterization of the created Plane. Use Plane.Create(Frame) to enforce a specific parameterization of the created Plane object.

#### Reference

Plane Class

Autodesk.Revit.DB Namespace